

function addWire(name, points, type, invisible = false) {
    window.allPostSwitchWires.push({
        name,
        points,
        type,
        invisible
    });
}

// === ДОБАВЛЕНИЕ ВСЕХ ПРОВОДОВ ===
addWire('plus_main',       [{x:1980,y:920},{x:1997,y:900},{x:1997,y:822},{x:2237,y:822}], 'plus');
addWire('minus_main',      [{x:1980,y:940},{x:2006,y:952},{x:2006,y:1000},{x:2227,y:1000},{x:2239,y:1000}], 'minus');
addWire('+ ножа',          [{x:1980,y:920},{x:1982,y:871}], 'plus');
addWire('+ до кКМ1-1',         [{x:1982,y:871},{x:1982,y:881},{x:1973,y:885},{x:1951,y:885},], 'plus');
addWire('+ до кКМ1-2',         [{x:1951,y:885},{x:1951,y:935}], 'plus');
addWire('+3 ножа',         [{x:1982,y:881},{x:1964,y:902},{x:1886,y:902}], 'plus');
addWire('+ ПП2',           [{x:1982,y:881},{x:1982,y:905},{x:1964,y:919},{x:1565,y:919}], 'plus');
addWire('МУВ +',           [{x:1565,y:919},{x:1298,y:919},{x:1298,y:737},{x:1987,y:737}], 'plus');
addWire('РММ 2',           [{x:1298,y:737},{x:1288,y:705},{x:1288,y:682},{x:1341,y:682}], 'plus');
addWire('АВ 10',           [{x:1298,y:737},{x:1298,y:705},{x:1341,y:705}], 'plus');
addWire('Кондиционер +',   [{x:1298,y:737},{x:1438,y:737},{x:1438,y:718},{x:1465,y:718}], 'plus');
addWire('ДРС',             [{x:1298,y:737},{x:1282,y:722},{x:1187,y:722},{x:1187,y:422},{x:1180,y:414},
                                {x:1171,y:422},{x:1171,y:737},{x:1298,y:737}], 'plus');
addWire('ПУ 1',            [{x:1180,y:414},{x:1180,y:361},{x:1172,y:349},{x:1172,y:246},{x:1241,y:246},
                                {x:1247,y:221},{x:1281,y:221},{x:1281,y:221},{x:1247,y:221},{x:1241,y:246},
                                {x:1241,y:267},{x:1249,y:260},{x:1287,y:260}], 'plus');

addWire('РРИ',             [{x:1180,y:414},{x:1180,y:361},{x:1188,y:349},{x:1188,y:267},{x:1241,y:267},
                                {x:1241,y:246},{x:1316,y:246}], 'plus');
addWire('ДНБС',            [{x:1241,y:267},{x:1250,y:275},{x:1291,y:275}], 'plus');
addWire('ПУ 2',            [{x:1180,y:361},{x:1211,y:361},{x:1211,y:313},{x:1252,y:313}], 'plus');
addWire('АВ 6',            [{x:1211,y:361},{x:1236,y:361},{x:1236,y:338},{x:1281,y:338}], 'plus');
addWire('+ БЭЛ',           [{x:1565,y:919},{x:1582,y:900},{x:1632,y:900}], 'plus');
addWire('Невидимка БЭЛ 4010',            [{x:1632,y:900},{x:300,y:1099}], 'plus', true);
addWire('БЭЛ 4020',            [{x:237,y:1076},{x:287,y:1076},], 'plus',);
addWire('БЭЛ 4010',            [{x:300,y:1099},{x:236,y:1099},], 'plus',);
addWire('Невидимка БЭЛ 4020',            [{x:287,y:1076},{x:289,y:1527},], 'plus', true);
addWire('Невидимка до упр.общее контроллер',            [{x:506,y:165},{x:314,y:699},], 'plus', true);
addWire('+ от 1.2 до упр.общее2.5 контроллер',           [{x:314,y:699},{x:314,y:737},{x:299,y:734},{x:288,y:734},
                                                       {x:288,y:724},{x:237,y:724},{x:251,y:724},{x:251,y:746},
                                                       {x:236,y:746},], 'plus');
addWire('+ от 1.2 до упр.общее39 контроллер',           [{x:314,y:737},{x:339,y:737},{x:339,y:767},{x:314,y:767},
                                                         {x:314,y:738},{x:314,y:767},{x:236,y:767},], 'plus');
addWire('+ от 1.2 до упр.общее43 контроллер',           [{x:339,y:767},{x:339,y:812},{x:236,y:812},{x:251,y:812},
                                                         {x:251,y:789},{x:236,y:790},], 'plus');
addWire('+ РЭР',           [{x:1565,y:919},{x:1586,y:875},{x:1632,y:875}], 'plus');
addWire('+ ПМН',           [{x:1565,y:919},{x:1565,y:867},{x:1510,y:867}], 'plus');
addWire('АВ 21 +',         [{x:2237,y:822},{x:2218,y:813},{x:2218,y:768},{x:2271,y:768}], 'plus');
addWire('+1 ножа',         [{x:1982,y:871},{x:1970,y:867},{x:1970,y:852},{x:1913,y:852},{x:1913,y:819},
                                {x:1876,y:819},{x:1876,y:806},{x:1888,y:806}], 'plus');
addWire('+ Питание АЛСН +',[{x:1982,y:871},{x:1982,y:882},{x:1991,y:877},{x:1991,y:807},{x:2089,y:807}], 'plus');
addWire('+ Питание АЛСН +1',[{x:2111,y:807},{x:2122,y:807},{x:2132,y:786},{x:2155,y:786},{x:2132,y:786},
                                {x:2122,y:807},{x:2122,y:770},{x:2155,y:770}], 'plus');
addWire('- ножа',          [{x:1980,y:940},{x:1981,y:984}], 'minus');
addWire('УСТА1_линия',     [{x:1913,y:806},{x:1980,y:806}], 'plus');
addWire('Дисплей_линия1',  [{x:1888,y:852},{x:1836,y:852},{x:1836,y:823}], 'plus');
addWire('Дисплей_линия -', [{x:1980,y:940},{x:1980,y:960},{x:1817,y:960},{x:1817,y:823}], 'minus');
addWire('МН-',             [{x:1980,y:940},{x:1980,y:972},{x:1933,y:972}], 'minus');
addWire('Невидимка МН-',             [{x:1933,y:972},{x:620,y:55},], 'minus', true);
addWire('МН- -',             [{x:620,y:55},{x:579,y:55},], 'minus');
addWire('кондиционер-',    [{x:1980,y:940},{x:1980,y:971},{x:1963,y:982},{x:1963,y:993},{x:1938,y:993}], 'minus');
addWire('клеммная -',      [{x:1980,y:940},{x:1980,y:984},{x:1958,y:1025},{x:1774,y:1025},{x:1774,y:960},
                                {x:1774,y:1042},{x:1774,y:1057},{x:1759,y:1057},{x:1759,y:1012}], 'minus');
addWire('ДНБС -',          [{x:1980,y:940}, {x:1980,y:984},{x:1963,y:1042},{x:1774,y:1042},{x:1790,y:1034},{x:1829,y:1034}], 'minus');
addWire('Питание АЛСН -',  [{x:1980,y:940},{x:1980,y:1057},{x:1774,y:1057},{x:1766,y:1051},{x:1766,y:993},
                                {x:1704,y:993}], 'minus');
addWire('Питание АЛСН -1', [{x:1683,y:993},{x:1669,y:993},{x:1669,y:1021},{x:1649,y:1021}], 'minus');
addWire('- БУНС',          [{x:2227,y:1000},{x:2227,y:1028},{x:2277,y:1028}], 'minus');
addWire('- МУВ',           [{x:2227,y:1000},{x:2203,y:1028},{x:2203,y:1089},{x:1209,y:1089},{x:1209,y:763},
                                {x:1987,y:763}], 'minus');
addWire('УСТА+_выход',     [{x:2111,y:807},{x:2130,y:807}], 'plus');
addWire('Невидимка ПМН',   [{x:1281,y:221},{x:152,y:55},], 'plus', true);
addWire('Невидимка КТН',   [{x:1281,y:221},{x:97,y:111},], 'plus', true);
addWire('Невидимка общий минус',   [{x:1774,y:960},{x:862,y:80},], 'minus', true);

addWire('ПМН точка 1',     [{x:152,y:55},{x:218,y:55},{x:218,y:37},{x:152,y:37},{x:218,y:37},
                                {x:218,y:55},{x:310,y:55},{x:296,y:69},{x:1,y:70},{x:1,y:1940},{x:222,y:1940}], 'plus');
addWire('ПУ 1 14-1\\2',    [{x:97,y:111},{x:161,y:111},{x:184,y:131},{x:96,y:131},{x:184,y:131},
                                {x:175,y:119},{x:175,y:98},{x:181,y:98}], 'plus');
addWire(' до КТН',         [{x:210,y:98},{x:389,y:98}], 'plus');
addWire('Управление Общее',[{x:213,y:131},{x:203,y:140},{x:203,y:202},{x:306,y:202},{x:306,y:179},
                                {x:213,y:179},{x:216,y:129}], 'plus');
addWire('К ключу БУ',      [{x:236,y:131},{x:254,y:131}], 'plus');
addWire('минус 2-8',       [{x:498,y:118},{x:444,y:118},{x:384,y:118},{x:444,y:118},{x:444,y:140},
                                {x:410,y:140},{x:384,y:140},{x:410,y:140},{x:410,y:157},{x:400,y:157}], 'minus');
addWire('toKBU',           [{x:254,y:131},{x:320,y:131},{x:320,y:118},{x:374,y:118}], 'plus');
addWire('От КБУ к УСТА4',   [{x:340,y:202},{x:340,y:218},{x:307,y:218}], 'plus');
addWire('От КБУ к УСТА1',   [{x:340,y:202},{x:328,y:158},{x:295,y:158}], 'plus');
addWire('От КБУ к клемной рейке',   [{x:340,y:202},{x:340,y:165},{x:373,y:165},{x:487,y:165},{x:506,y:165},], 'plus');
addWire('От КБУ к возврат реле',   [{x:373,y:165},{x:373,y:202},{x:373,y:202},{x:430,y:202},], 'plus');
addWire('От КБУ к кКУ17',   [{x:373,y:165},{x:363,y:179},{x:363,y:232},{x:12,y:232},{x:15,y:1527},
                                    {x:130,y:1527},{x:131,y:1527},], 'plus');
addWire('От КБУ к БГ',   [{x:131,y:1527},{x:108,y:1518},{x:108,y:1482},{x:131,y:1482},], 'plus');
addWire('От КБУ к кРУ14',   [{x:131,y:1527},{x:131,y:1552},{x:77,y:1552},{x:77,y:2257},{x:331,y:2257},{x:331,y:2286},
                             {x:300,y:2286},], 'plus');
addWire('От КБУ к Отпуск тормозов',   [{x:331,y:2286},{x:331,y:2310},{x:331,y:2310},{x:536,y:2310},], 'plus');
addWire('От КБУ к кРВ6',   [{x:131,y:1527},{x:131,y:1506},{x:676,y:1506},], 'plus');
addWire('От КБУ к кРУ40',   [{x:676,y:1506},{x:662,y:1493},{x:662,y:1465},{x:680,y:1465},], 'plus');
addWire('От КБУ к РВ6-1',   [{x:676,y:1506},{x:676,y:1478},{x:757,y:1478},], 'plus');
addWire('От БЭЛ',   [{x:289,y:1527},{x:233,y:1527},{x:160,y:1527},{x:160,y:1562},{x:160,y:1575},{x:289,y:1575},{x:598,y:1575},], 'plus');
addWire('От к кнопкам',   [{x:233,y:1527},{x:233,y:1621},{x:196,y:1621},{x:196,y:1629},{x:161,y:1629},{x:161,y:1650},
                           {x:161,y:1665},{x:160,y:1665},{x:153,y:1665},{x:153,y:1732},{x:160,y:1732},{x:160,y:1745},
                           {x:160,y:1757},{x:160,y:1774},{x:160,y:1806},{x:160,y:1821},], 'plus');
addWire('От управление общее к Ключ БУ', [{x:213,y:131},{x:235,y:131}], 'plus');
addWire('От тумблера КМН до кКУ17',   [{x:192,y:1821},{x:192,y:1806},{x:473,y:1806},], 'plus');
addWire('От Пуск Дизеля',   [{x:193,y:1650},{x:193,y:1665},{x:193,y:1681},{x:161,y:1681},{x:161,y:1700},], 'plus');
addWire('До Стоп ПУ-2',   [{x:193,y:1700},{x:371,y:1700},], 'plus');
addWire('От Стоп ПУ-2 до кРУ22',   [{x:403,y:1700},{x:525,y:1700},], 'plus');
addWire('От кРУ22 до кПЧТ',   [{x:555,y:1700},{x:602,y:1700},], 'plus');
addWire('От кПЧТ до РУ12',   [{x:634,y:1700},{x:748,y:1700},], 'plus');
addWire('Общий минус',   [{x:862,y:80},{x:862,y:97},{x:862,y:203},{x:862,y:368},{x:905,y:406},{x:920,y:420},
                          {x:920,y:531},{x:920,y:1628},{x:920,y:1685},{x:920,y:1725},{x:920,y:1940},
                          {x:920,y:2024},{x:920,y:2084},{x:920,y:2195},{x:920,y:2228},],'minus');
addWire('минус на П1иП2',   [{x:905,y:406},{x:802,y:406},{x:789,y:406},{x:802,y:406},{x:802,y:431},{x:790,y:431},
                             {x:802,y:431},{x:802,y:378},{x:773,y:378},{x:802,y:378},{x:802,y:362},{x:794,y:362},],'minus');
addWire('минус до кРЗ (РВиРКВ)',   [{x:920,y:531},{x:820,y:531},],'minus');
addWire('минус к РВ2',   [{x:920,y:1628},{x:763,y:1628},{x:763,y:1602},{x:748,y:1602},{x:763,y:1602},{x:826,y:1571},{x:826,y:1472},
                          {x:781,y:1472},{x:768,y:1472},{x:781,y:1472},{x:781,y:1452},{x:646,y:1452},{x:637,y:1452},
                          {x:646,y:1452},{x:646,y:1479},{x:636,y:1479},],'minus');
addWire('минус к РУ12 и КУ17',   [{x:920,y:1685},{x:780,y:1685},{x:770,y:1700},{x:758,y:1700},{x:826,y:1700},
                           {x:826,y:2036},{x:789,y:2036},{x:768,y:2050},{x:737,y:2050},],'minus');
addWire('Минус от КУ17 к РУ14(5)',   [{x:768,y:2050},{x:788,y:2062},{x:952,y:2062},],'minus');
addWire('Минус от КУ17 к КУ10 РЭР РВС',   [{x:768,y:2050},{x:903,y:2050},{x:905,y:429},{x:850,y:380},{x:850,y:262},
                                           {x:838,y:262},{x:814,y:280},{x:797,y:280},{x:742,y:280},{x:723,y:280},
                                           {x:742,y:280},{x:742,y:298},{x:722,y:298},{x:742,y:298},{x:742,y:280},
                                           {x:797,y:280},{x:797,y:331},{x:750,y:331},{x:774,y:331},{x:774,y:305},
                                           {x:756,y:305},],'minus');
addWire('минус до КТН',   [{x:920,y:1725},{x:768,y:1725},{x:737,y:1725},],'minus');
addWire('минус От КТН до кРКВ',   [{x:768,y:1725},{x:768,y:1712},{x:912,y:1712},{x:913,y:425},{x:855,y:374},
                                   {x:855,y:227},{x:825,y:227},],'minus');
addWire('минус от КТН до КМН',   [{x:768,y:1725},{x:815,y:1733},{x:815,y:1796},{x:768,y:1796},{x:758,y:1796},],'minus');
addWire('минус от КМН до РУ28',   [{x:768,y:1796},{x:801,y:1789},{x:801,y:1749},{x:768,y:1749},{x:758,y:1749},],'minus');
addWire('минус от РУ28 до РУ29',   [{x:768,y:1749},{x:791,y:1754},{x:791,y:1823},{x:768,y:1828},{x:737,y:1828},],'minus');
addWire('минус от РУ29 до РУ30',   [{x:768,y:1828},{x:791,y:1834},{x:791,y:1896},{x:759,y:1896},],'minus');
addWire('минус от РВ2 к РВ4',   [{x:763,y:1602},{x:863,y:1602},{x:864,y:485},{x:791,y:485},{x:783,y:470},{x:735,y:470},],'minus');
addWire('минус от РВ4 к РВ3',   [{x:783,y:470},{x:890,y:470},{x:890,y:1768},{x:737,y:1768},],'minus');
addWire('минус от РВ4 к РВ5',   [{x:783,y:470},{x:793,y:453},{x:898,y:453},{x:898,y:1873},{x:737,y:1873},],'minus');
addWire('минус на Д1',   [{x:920,y:1940},{x:780,y:1940},{x:768,y:1924},{x:759,y:1924},],'minus');
addWire('минус от Д1 на Ш1 Ш2 и РУ7',   [{x:768,y:1924},{x:882,y:1924},{x:882,y:1437},{x:748,y:1437},{x:800,y:1437},
                                {x:800,y:1423},{x:729,y:1423},{x:800,y:1423},{x:800,y:1507},{x:768,y:1507},
                                {x:800,y:1507},{x:789,y:1525},{x:781,y:1525},{x:789,y:1525},{x:800,y:1507},
                                {x:800,y:1550},{x:768,y:1550},],'minus');
addWire('минус на РУ4',   [{x:920,y:2024},{x:768,y:2024},{x:758,y:2024},],'minus');
addWire('минус от РУ4 до РУ5',   [{x:768,y:2024},{x:768,y:2003},{x:801,y:2003},{x:801,y:1858},{x:768,y:1849},{x:758,y:1849},],'minus');
addWire('минус от РУ5 на КБУ',   [{x:758,y:1849},{x:952,y:1849},],'minus');
addWire('Невидимка От РУ5 на КБУ',   [{x:952,y:1849},{x:498,y:118},], 'minus', true);
addWire('минус от РУ4 до кРУ2',   [{x:768,y:2024},{x:777,y:2008},{x:970,y:2008},{x:970,y:2394},{x:806,y:2394},{x:806,y:2410},
                                   {x:795,y:2410},],'minus');
addWire('минус от кРУ2 до РУ2',   [{x:806,y:2410},{x:876,y:2410},{x:876,y:716},{x:784,y:716},{x:760,y:716},
                                   {x:784,y:716},{x:778,y:700},{x:760,y:700},],'minus');
addWire('минус от РУ2 до БРН',   [{x:784,y:716},{x:784,y:732},{x:952,y:732},],'minus');
addWire('От кРУ12 до РУ12',   [{x:193,y:1562},{x:245,y:1562},{x:245,y:1650},{x:193,y:1650},],'plus');
addWire('От кРУ12 до кРУ16',   [{x:193,y:1562},{x:204,y:1550},{x:253,y:1550},{x:254,y:1888},{x:279,y:1888},],'plus');
addWire('От кРУ16 до кРУ12',   [{x:309,y:1888},{x:354,y:1888},],'plus');
addWire('От кРУ12 до кД1',   [{x:382,y:1888},{x:382,y:1963},{x:405,y:1963},],'plus');
addWire('От кРУ12 до кРУ4',   [{x:382,y:1963},{x:352,y:1963},{x:352,y:1963},{x:352,y:1995},],'plus');
addWire('От кРУ12 до кРУ7',   [{x:352,y:1995},{x:316,y:1995},{x:316,y:1607},{x:625,y:1607},],'plus');
addWire('От кРУ12 до кРВ2-1',   [{x:625,y:1607},{x:625,y:1585},{x:725,y:1585},{x:725,y:1597},{x:738,y:1597},],'plus');
addWire('От кРУ12 до вкРУ4',   [{x:352,y:1995},{x:344,y:1986},{x:344,y:1740},{x:556,y:1740},{x:556,y:1725},],'plus');
addWire('От вкРУ4 до КТН',   [{x:556,y:1725},{x:727,y:1725},],'plus');
addWire('минус до ТН',   [{x:862,y:80},{x:862,y:98},{x:750,y:98},],'minus');
addWire('От кКТН до ТН',   [{x:412,y:98},{x:669,y:98},],'plus');
addWire('От тТН до кРУ4',   [{x:193,y:1745},{x:193,y:1732},{x:283,y:1732},{x:283,y:1725},{x:527,y:1725},],'plus');
addWire('От тТН до кКТН',   [{x:193,y:1757},{x:193,y:1774},{x:293,y:1774},{x:293,y:1763},{x:363,y:1763},],'plus');
addWire('От кРУ4 до РУ4',   [{x:381,y:1995},{x:381,y:2015},{x:715,y:2015},{x:715,y:2024},{x:748,y:2024},],'plus');
addWire('От кКТН до кРУ5',   [{x:389,y:1763},{x:389,y:1873},{x:416,y:1873},],'plus');
addWire('От кКТН до кРУ4',   [{x:416,y:1873},{x:416,y:1787},],'plus');
addWire('От кРУ4 до кШ2',   [{x:446,y:1787},{x:446,y:1822},{x:328,y:1822},{x:328,y:1550},{x:622,y:1550},],'plus');
addWire('От кРУ7 до РВ2',   [{x:656,y:1607},{x:738,y:1607},{x:738,y:1602},],'plus');
addWire('От кШ2 до РУ7',   [{x:650,y:1550},{x:758,y:1550},],'plus');
addWire('От кКТН до кКУ17',   [{x:389,y:1763},{x:419,y:1763},],'plus');
addWire('От кКУ17 до РВ2',   [{x:443,y:1763},{x:507,y:1763},],'plus');
addWire('От РВ2 до РУ28',   [{x:530,y:1763},{x:578,y:1763},{x:578,y:1738},{x:716,y:1738},{x:716,y:1749},{x:748,y:1749},],'plus');
addWire('От кКУ17 до кРУ28',   [{x:716,y:1749},{x:611,y:1749},{x:611,y:1767},{x:630,y:1769},],'plus');
addWire('От кКУ17 до кРУ29',   [{x:630,y:1769},{x:630,y:1777},{x:586,y:1777},{x:586,y:1849},{x:615,y:1849},],'plus');
addWire('От кРУ4 до кРУ28',   [{x:446,y:1787},{x:544,y:1787},],'plus');
addWire('От кРУ28 до КМН',   [{x:572,y:1787},{x:716,y:1787},{x:716,y:1796},],'plus');
addWire('Точка у КМН',   [{x:716,y:1796},{x:748,y:1796}],'plus');
addWire('От кКУ17 до КМН',   [{x:492,y:1806},{x:716,y:1806},{x:716,y:1796},],'plus');
addWire('От кКМН до МН',   [{x:341,y:55},{x:498,y:55},],'plus');
addWire('От кРУ28 до РВ3',   [{x:658,y:1769},{x:727,y:1768},],'plus');
addWire('От кРВ2 до кРВ3',   [{x:530,y:1763},{x:530,y:1828},{x:616,y:1828},],'plus');
addWire('От кРВ3 до РУ29',   [{x:644,y:1828},{x:727,y:1829},],'plus');
addWire('От кРУ5 до кКВ',   [{x:240,y:1940},{x:283,y:1940},],'plus');
addWire('От кРУ5 до РВ5',   [{x:441,y:1873},{x:727,y:1873},],'plus');
addWire('От кРУ29 до РУ5',   [{x:634,y:1849},{x:748,y:1849},],'plus');
addWire('От кРУ5 до кРВ5',   [{x:416,y:1873},{x:416,y:1896},{x:551,y:1896},],'plus');
addWire('От кРВ5 до РУ30',   [{x:579,y:1896},{x:749,y:1896},],'plus');
addWire('От кРУ4 до кРУ30',   [{x:352,y:1995},{x:352,y:2031},],'plus');
addWire('От кРУ30 до РУ4',   [{x:379,y:2031},{x:715,y:2031},{x:715,y:2024},],'plus');
addWire('От кРВ до БУК',   [{x:311,y:1940},{x:423,y:1940},],'plus');
addWire('От БУК до ВПУ',   [{x:445,y:1940},{x:564,y:1940},],'plus');
addWire('От ВПУ до Д1',   [{x:589,y:1940},{x:626,y:1940},{x:644,y:1924},{x:749,y:1924},],'plus');
addWire('От кД1 до кД1',   [{x:424,y:1963},{x:424,y:2049},{x:535,y:2049},],'plus');
addWire('От кД1 до КУ17',   [{x:555,y:2049},{x:727,y:2050},],'plus');
addWire('От кД1 на РЭР',   [{x:424,y:1963},{x:472,y:1963},{x:472,y:1980},],'plus');
addWire('От точки до РЭР',   [{x:472,y:1980},{x:448,y:1980},],'plus');
addWire('От кД1 до РДМ',   [{x:472,y:1980},{x:610,y:1980},{x:610,y:1995},{x:543,y:1995},],'plus');
addWire('От РДМ до кРУ4',   [{x:515,y:1995},{x:381,y:1995},],'plus');
addWire('Невидимка ПП2 до кРЭР',   [{x:1632,y:875},{x:2442,y:2024},],'plus', true);
addWire('От ПП2 3090 до кРЭР',   [{x:2442,y:2024},{x:2487,y:2024},],'plus');
addWire('Невидимка 3102 до РЭР',   [{x:448,y:1980},{x:627,y:305},],'plus', true);
addWire('От 3102 до РЭР',   [{x:627,y:305},{x:746,y:305},],'plus');
addWire('От кРЭР до блока',   [{x:2509,y:2024},{x:2631,y:2024},],'plus');
addWire('От кД1+ до кП2',   [{x:2275,y:822},{x:2300,y:822},{x:2300,y:215},{x:2918,y:215},{x:2918,y:236},{x:2901,y:252},],'plus');
addWire('От кП2 до кКВТ1',   [{x:2901,y:252},{x:2998,y:254},{x:2998,y:313},{x:3015,y:313},{x:3029,y:322},],'plus');
addWire('От кКВТ1 до кП1',   [{x:3029,y:322},{x:3029,y:336},{x:3077,y:336},{x:3077,y:279},{x:3060,y:279},
                              {x:3060,y:202},{x:2652,y:201},{x:2601,y:252},],'plus');
addWire('От кП2 до генератора',   [{x:2901,y:252},{x:2901,y:237},{x:2333,y:237},{x:2333,y:497},{x:2340,y:506},],'plus');
addWire('От кП1 до генератора',   [{x:2601,y:252},{x:2347,y:252},{x:2347,y:497},{x:2340,y:506},],'plus');
addWire('От кД1- до генератора',   [{x:2278,y:1000},{x:2311,y:1000},{x:2311,y:585},{x:2340,y:585},],'minus');
addWire('От кКУ17 до Авт возбуждение',   [{x:1266,y:361},{x:1330,y:360},],'plus');
addWire('От Авт возбуждение до точки',   [{x:1372,y:362},{x:1446,y:360},],'plus');
addWire('От точки до кВВ',   [{x:1446,y:360},{x:1525,y:360},],'plus');
addWire('От точки до БРН',   [{x:1446,y:360},{x:1446,y:329},{x:1522,y:329},{x:1522,y:276},],'plus');
addWire('От точки до тумб возбуждение',   [{x:1446,y:360},{x:1446,y:414},{x:1321,y:414},{x:1321,y:443},{x:1327,y:443},],'plus');
addWire('внутри тумблера возбуждение',   [{x:1327,y:443},{x:1327,y:494},],'plus');
addWire('От кКМ1 до уста 6033',   [{x:1912,y:885},{x:1912,y:871},{x:1889,y:871},],'plus');
addWire('От кКМ1 до уста 6032',   [{x:1912,y:885},{x:1889,y:885},],'plus');
addWire('От кКМ1 до уста 5151',   [{x:1923,y:935},{x:1879,y:935},],'plus');
addWire('От Невидимка до уста 6034',   [{x:1889,y:871},{x:1814,y:362},],'plus', true);
addWire('От уста 6034 до ДЗБ',   [{x:1814,y:362},{x:1658,y:361},],'plus');
addWire('От уста 6035 до ДЗБ',   [{x:1814,y:377},{x:1658,y:377},{x:1658,y:361},],'plus');
addWire('От ДЗБ до кВВ',   [{x:1613,y:361},{x:1567,y:361},],'plus');
addWire('От кВВ до ВСТ',   [{x:1567,y:361},{x:1567,y:253},{x:1781,y:253},{x:1781,y:268},{x:1800,y:268},],'plus');
addWire('Невидимка - до возбуждения ВСТ',   [{x:1774,y:960},{x:1657,y:575},],'minus', true);
addWire('- От 2-2 до РНП',   [{x:1657,y:575},{x:1657,y:514},{x:1693,y:513},],'minus');
addWire('- От 2-2 до кКМ1',   [{x:1657,y:575},{x:1635,y:575},{x:1634,y:469},],'minus');
addWire('- От 2-2 до 6064 уста',   [{x:1634,y:469},{x:1634,y:435},{x:1588,y:435},],'minus');
addWire('- От 2-2 до КМ1',   [{x:1635,y:575},{x:1605,y:575},{x:1605,y:492},{x:1567,y:492},{x:1552,y:492},],'minus');
addWire('- От 2-2 до РКМ1',   [{x:1567,y:492},{x:1567,y:443},{x:1443,y:443},{x:1435,y:443},],'minus');
addWire('- От 2-2 до кРКМ1',   [{x:1443,y:443},{x:1443,y:552},{x:1753,y:552},],'minus');
addWire('- От 2-2 до РЗ 1070',   [{x:1605,y:575},{x:1596,y:567},{x:1596,y:534},{x:1569,y:534},],'minus');
addWire('- От 2-2 до ВВ',   [{x:1605,y:575},{x:1583,y:575},],'minus');
addWire('- От кКМ1 до ВСТ',   [{x:1672,y:471},{x:1721,y:469},{x:1721,y:493},{x:1759,y:493},{x:1759,y:422},
                               {x:1743,y:422},{x:1743,y:267},{x:1763,y:267},{x:1763,y:295},{x:1800,y:295},],'minus');
addWire('От тумб возб до кРНП',   [{x:1356,y:494},{x:1460,y:492},],'plus');
addWire('От кРНП до КМ1',   [{x:1484,y:492},{x:1542,y:492},],'plus');
addWire('Невидимка - от РУ2 до БРН',   [{x:952,y:732},{x:1435,y:310},],'minus', true);
addWire('- От 118 РУ2 до БРН',   [{x:1435,y:310},{x:1506,y:310},{x:1506,y:275},],'minus');
addWire('Невидимка - внутри БРН',   [{x:1506,y:275},{x:1491,y:275},],'minus', true);
addWire('- От БРН до кРКМ1',   [{x:1491,y:275},{x:1491,y:394},{x:1549,y:394},],'minus');
addWire('От тумб возб до РКМ1',   [{x:1356,y:443},{x:1415,y:443},{x:1425,y:443},],'plus');
addWire('- От РКМ1 до ВСТ',   [{x:1572,y:394},{x:1707,y:394},{x:1707,y:423},{x:1743,y:422},],'minus');
addWire('От тумб возб до ВВ',   [{x:1415,y:443},{x:1415,y:575},{x:1448,y:575},{x:1573,y:575},],'plus');
addWire('От тумб возб до кРКВ',   [{x:1448,y:575},{x:1448,y:592},{x:1753,y:592},],'plus');
addWire('От ВСТ до МУВ',   [{x:1831,y:268},{x:1988,y:268},],'plus');
addWire('От - ВСТ до - МУВ',   [{x:1831,y:295},{x:1988,y:295},],'minus');
addWire('От упр общее 43 до реверсор вперёд',   [{x:240,y:834},{x:378,y:834},],'plus');
addWire('Невидимка 171 до 171 реверсор вперёд',   [{x:378,y:834},{x:129,y:254},],'plus', true);
addWire('171 до кКУ10',   [{x:129,y:254},{x:455,y:254},],'plus');
addWire('От упр общее 43 до реверсор назад',   [{x:239,y:856},{x:378,y:856},],'plus');
addWire('Невидимка 164 до 164 реверсор назад',   [{x:378,y:856},{x:129,y:289},],'plus', true);
addWire('От 164 до КУ10',   [{x:129,y:289},{x:689,y:289},{x:702,y:280},{x:713,y:280},],'plus');
addWire('От 164 до кКУ10',   [{x:702,y:280},{x:674,y:280},],'plus');
addWire('От кКУ10 до кРН',   [{x:648,y:280},{x:630,y:280},{x:614,y:253},],'plus');
addWire('От кРН до РН',   [{x:648,y:280},{x:630,y:280},{x:614,y:253},],'plus');
addWire('От кКУ10 до кРВ',   [{x:483,y:254},{x:512,y:254},],'plus');
addWire('От кРНв до РВ',   [{x:512,y:254},{x:512,y:227},{x:712,y:227},],'plus');
addWire('От от кРВ до кРН',   [{x:545,y:254},{x:559,y:254},{x:586,y:254},],'plus');
addWire('От от кРВ до кРВ4',   [{x:559,y:254},{x:559,y:379},{x:567,y:379},],'plus');
addWire('От кРН до РН',   [{x:614,y:253},{x:746,y:253},],'plus');
addWire('От кРВ4 до кРУ24',   [{x:593,y:378},{x:625,y:378},],'plus');
addWire('От кРУ24 до ОМ',   [{x:645,y:378},{x:661,y:379},],'plus');
addWire('От П1 до кП1',   [{x:802,y:378},{x:830,y:378},{x:830,y:355},],'minus');
addWire('От кП1 до кП2',   [{x:830,y:325},{x:831,y:304},],'minus');
addWire('От кП2 до РН',   [{x:831,y:277},{x:831,y:253},{x:778,y:253},{x:756,y:253},],'minus');
addWire('От кП2 до РВ',   [{x:778,y:253},{x:778,y:227},{x:722,y:227},],'minus');
addWire('От кРКВ',   [{x:800,y:227},{x:778,y:227},],'minus');
addWire('От ОМ1 до П1',   [{x:729,y:378},{x:763,y:378},],'plus');
addWire('От ОМ2 до П2',   [{x:729,y:405},{x:779,y:406},],'plus');
addWire('От Кв Тяга до кПЧТ ',   [{x:236,y:900},{x:307,y:900},],'plus');
addWire('От кПЧТ до кЭПК',   [{x:307,y:900},{x:385,y:900},{x:385,y:639},{x:119,y:639},{x:121,y:330},
                              {x:125,y:327},{x:167,y:325},],'plus');
addWire('От кЭПК до кРММ1. ',   [{x:200,y:325},{x:227,y:325},],'plus');
addWire('От кЭПК до кРММ2. ',   [{x:227,y:325},{x:201,y:354},{x:201,y:374},{x:227,y:373},],'plus');
addWire('От кРММ1 до УмПУ1',   [{x:251,y:325},{x:304,y:325},{x:304,y:314},],'plus');
addWire('От кРММ2 до УмПУ2',   [{x:251,y:373},{x:304,y:373},{x:304,y:361},],'plus');
addWire('От кРММ1 до кРЭТ',   [{x:342,y:314},{x:342,y:325},{x:357,y:325},{x:358,y:337},{x:455,y:337},
                               {x:455,y:401},{x:251,y:401},{x:251,y:420},{x:279,y:420},],'plus');
addWire('От кРММ2 до кРЭТ',   [{x:342,y:361},{x:342,y:373},{x:351,y:373},{x:351,y:391},{x:252,y:391},
                                {x:251,y:401},],'plus');
addWire('От кРЭТ до РУ15',   [{x:302,y:420},{x:314,y:420},],'plus');
addWire('От РУ15 до кБК1',   [{x:338,y:420},{x:357,y:420},{x:357,y:437},{x:143,y:437},{x:143,y:470},{x:176,y:470},],'plus');
addWire('От кБК1 до кБК2',   [{x:201,y:470},{x:227,y:470},],'plus');
addWire('От кБК2 до кБК3',   [{x:250,y:470},{x:277,y:470},],'plus');
addWire('От кБК3 до кКВ',   [{x:307,y:470},{x:367,y:470},{x:367,y:448},{x:403,y:448},],'plus');
addWire('От кКВ до кРУ2',   [{x:403,y:448},{x:403,y:470},{x:409,y:470},],'plus');
addWire('От кКВ до кКВТ1',   [{x:434,y:448},{x:455,y:448},{x:455,y:470},{x:500,y:470},],'plus');
addWire('От кРУ2 до кКВТ1',   [{x:435,y:470},{x:455,y:470},],'plus');
addWire('От кКВТ1 до РВ4',   [{x:524,y:470},{x:725,y:470},],'plus');
addWire('От кРУ2 до кРТ',   [{x:455,y:470},{x:455,y:498},{x:435,y:498},],'plus');
addWire('От кРТ до sp2',   [{x:410,y:498},{x:311,y:498},],'plus');
addWire('От sp2 до кП1',   [{x:277,y:498},{x:143,y:498},{x:143,y:530},],'plus');
addWire('От кП1 до ОМ1-1',   [{x:143,y:530},{x:143,y:567},{x:154,y:567},],'plus');
addWire('От кП1 до кП2',   [{x:173,y:530},{x:211,y:530},],'plus');
addWire('От кП1 до ОМ1-3',   [{x:211,y:530},{x:211,y:538},{x:234,y:538},{x:234,y:567},{x:222,y:567},],'plus');
addWire('От кП2 до ОМ1-2',   [{x:245,y:530},{x:245,y:614},{x:164,y:614},{x:163,y:609},],'plus');
addWire('От кП2 до кД1',   [{x:245,y:530},{x:258,y:530},],'plus');
addWire('От кД1 до кРУ24',   [{x:280,y:530},{x:300,y:530},],'plus');
addWire('От кРУ24 до кРУ14',   [{x:325,y:530},{x:343,y:530},],'plus');
addWire('От кРУ14 до РТ6',   [{x:366,y:530},{x:438,y:530},],'plus');
addWire('От РТ6 до РТ3',   [{x:466,y:530},{x:525,y:530},],'plus');
addWire('Оn РТ3 до ДРТ4',   [{x:553,y:530},{x:626,y:530},],'plus');
addWire('Оn ДРТ4 до КВ',   [{x:656,y:530},{x:748,y:530},{x:758,y:531},],'plus');
addWire('Оn кРЗ до КВ',   [{x:797,y:530},{x:779,y:530},{x:768,y:530},],'minus');
addWire('Оn кРЗ до РКВ',   [{x:779,y:530},{x:779,y:547},{x:800,y:547},{x:800,y:565},{x:768,y:565},],'minus');
addWire('Оn ДРТ4 до РКВ',   [{x:748,y:530},{x:748,y:547},{x:724,y:547},{x:724,y:565},{x:758,y:565},],'plus');
addWire('От МУВ + до кКВ',   [{x:2045,y:678},{x:2173,y:678},{x:2173,y:430},],'plus');
addWire('Оn МУВ - до обм',   [{x:2045,y:718},{x:2218,y:718},{x:2218,y:625},],'minus');
addWire('От кКВ до обм',   [{x:2217,y:430},{x:2219,y:564},],'plus');
addWire('Невидимка от вст до мув +',   [{x:1988,y:268},{x:2045,y:678},],'plus', true);
addWire('Невидимка от вст до мув -',   [{x:1988,y:295},{x:2045,y:718},],'minus', true);
addWire('От кП1 до ТЭД1',   [{x:2601,y:291},{x:2601,y:400},],'plus');
addWire('От ТЭД1 до ТЭД2',   [{x:2601,y:420},{x:2601,y:460},],'plus');
addWire('От ТЭД2 до ТЭД3',   [{x:2601,y:480},{x:2601,y:520},],'plus');
addWire('От ТЭД3 до кРеверс',   [{x:2601,y:540},{x:2601,y:690},{x:2618,y:699},],'plus');
addWire('внутри реверса вперёд-назад1-1',   [{x:2618,y:651},{x:2637,y:652},], 'plus');
addWire('внутри реверса вперёд-назад2-1',   [{x:2637,y:746},{x:2618,y:747},], 'plus');
addWire('От реверса до обм',   [{x:2637,y:652},{x:2639,y:652},{x:2639,y:611},{x:2640,y:611},{x:2687,y:611},{x:2689,y:618},], 'minus');
addWire('От реверса до обм-1',   [{x:2637,y:652},{x:2635,y:652},{x:2635,y:607},{x:2691,y:607},{x:2689,y:618},], 'plus');
addWire('От реверса до обм1',   [{x:2637,y:746},{x:2637,y:777},{x:2688,y:777},{x:2688,y:767},], 'minus');
addWire('От реверса до обм1-1',   [{x:2637,y:746},{x:2634,y:746},{x:2634,y:780},{x:2691,y:780},{x:2688,y:767},], 'plus');
addWire('Оn генератора до реверсора1 -',   [{x:2340,y:585},{x:2347,y:593},{x:2347,y:837},{x:2391,y:837},
                                           {x:2400,y:846},{x:2458,y:846},{x:2468,y:831},{x:2673,y:831},
                                           {x:2673,y:699},{x:2637,y:699},],'minus');
addWire('От кП2 до ТЭД4',   [{x:2901,y:291},{x:2901,y:400},],'plus');
addWire('От ТЭД4 до ТЭД5',   [{x:2901,y:420},{x:2901,y:460},],'plus');
addWire('От ТЭД5 до ТЭД6',   [{x:2901,y:480},{x:2901,y:520},],'plus');
addWire('От ТЭД6 до кРеверс',   [{x:2901,y:540},{x:2901,y:690},{x:2919,y:699},],'plus');
addWire('Внутри реверсора ',   [{x:2919,y:652},{x:2938,y:652},],'plus');
addWire('ОТ реверсора до Обм ',   [{x:2938,y:652},{x:2940,y:652},{x:2940,y:611},{x:2988,y:611},{x:2990,y:618},],'plus');
addWire('ОТ реверсора до Обм ',   [{x:2938,y:652},{x:2937,y:652},{x:2937,y:609},{x:2992,y:609},{x:2990,y:618},],'minus');
addWire('Внутри реверсора1 ',   [{x:2919,y:747},{x:2938,y:746},],'plus');
addWire('ОТ реверсора до Обм1 ',   [{x:2938,y:746},{x:2940,y:746},{x:2940,y:775},{x:2988,y:775},{x:2990,y:767},],'plus');
addWire('ОТ реверсора до Обм1 ',   [{x:2938,y:746},{x:2938,y:746},{x:2938,y:778},{x:2992,y:778},{x:2990,y:767},],'minus');
addWire('ОТ ДГУ до реверосра - ',   [{x:2458,y:846},{x:2972,y:846},{x:2972,y:699},{x:2938,y:699},],'minus');
addWire('От КМ до РУ2 ',   [{x:236,y:922},{x:409,y:922},{x:409,y:716},{x:750,y:716},],'plus');
addWire('Невидимка от 1-8 до ЭР кРУ2 ',   [{x:373,y:165},{x:2441,y:1999},],'plus', true);
addWire('От ЭР до кРУ2',   [{x:2441,y:1999},{x:2484,y:1999},],'plus');
addWire('От кРУ2 до ЭР',   [{x:2511,y:1999},{x:2554,y:1999},{x:2554,y:2009},{x:2631,y:2009},],'plus');
addWire('ОТ 2ПКМ до точки ',   [{x:409,y:922},{x:409,y:1341},],'plus');
addWire('ОТ ВТ1 до 3-19 ',   [{x:236,y:944},{x:288,y:944},],'plus');
addWire('Невидимка ОТ ВТ1 до 3-19 ',   [{x:288,y:944},{x:410,y:1239},],'plus', true);
addWire('ОТ невидимки  до 3-19 ',   [{x:410,y:1239},{x:491,y:1239},{x:491,y:1223},],'plus');
addWire('Невидимка От 3-19 до ЭР',   [{x:410,y:1239},{x:2570,y:1948},],'plus', true);
addWire('От 3-19 до ЭР',   [{x:2570,y:1948},{x:2632,y:1948},],'plus');
addWire('От ВТ2 до 3-21',   [{x:236,y:967},{x:289,y:967},],'plus');
addWire('Невидимка ВТ 2 до 3-21',   [{x:289,y:967},{x:409,y:1271},],'plus', true);
addWire('От Невидимки до 3-21',   [{x:409,y:1271},{x:485,y:1271},],'plus');
addWire('Невидимка от 3-21 до ЭР',   [{x:409,y:1271},{x:2570,y:1964},],'plus', true);
addWire('от 3-21 до ЭР',   [{x:2570,y:1964},{x:2632,y:1964},],'plus');
addWire('От ВТ3 до 3-25',   [{x:236,y:988},{x:288,y:988},],'plus');
addWire('Невидимка От ВТ3 до 3-25',   [{x:288,y:988},{x:410,y:1299},],'plus', true);
addWire('От Невидимка до 3-25',   [{x:410,y:1299},{x:516,y:1299},],'plus');
addWire('Невидимка от 3-25 до ЭР',   [{x:516,y:1299},{x:2569,y:1979},],'plus', true);
addWire('От 3-25 до ЭР',   [{x:2569,y:1979},{x:2631,y:1979},],'plus');
addWire('От ВТ4 до 3-27',   [{x:236,y:1011},{x:288,y:1011},],'plus');
addWire('Невидимка От ВТ4 до 3-27',   [{x:288,y:1011},{x:411,y:1342},],'plus', true);
addWire('От невидимки до 3-27',   [{x:411,y:1342},{x:503,y:1341},{x:503,y:1372},],'plus');
addWire('Невидимка От 3-27 до ЭР',   [{x:503,y:1341},{x:2569,y:1994},],'plus', true);
addWire('От 3-27 до ЭР',   [{x:2569,y:1994},{x:2631,y:1994},],'plus');
